src/cfe/Catalogs/СхемыHTTPСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СхемыHTTPСервисов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема1С</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Catalogs/СхемыHTTPСервисов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Обработчик события формы "ПриЧтенииНаСервере".
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект.HTTPСервисы
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Схема1С = НовыйСхема1С(ТекущийОбъект.Схема1С.Получить());
	
КонецПроцедуры

// Обработчик события формы "ПриОткрытии".
//
// Параметры:
//  Отказ - Булево
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьHTTPСервисы();
	ЗаполнитьСхемуJSON();
	
КонецПроцедуры

// Обработчик события формы "ПередЗаписьюНаСервере".
//
// Параметры:
//  Отказ - Булево
//  ТекущийОбъект - СправочникОбъект.HTTPСервисы
//  ПараметрыЗаписи - Структура
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Схема = Коллекции.ЗначениеСвойстваСтруктуры(Схема1С, "Схема");
	ТекущийОбъект.Схема1С = Новый ХранилищеЗначения(Схема, Новый СжатиеДанных(9));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыHTTPСервисы

// Обработчик события "ПриАктивизацииСтроки" таблицы "HTTPСервисы".
//
// Параметры:
//  Элемент - ПолеФормы
//
&НаКлиенте
Процедура HTTPСервисыПриАктивизацииСтроки(Элемент)
	
	ОчиститьПараметры();
	ОчиститьТелоЗапроса();
	ОчиститьОтветы();
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Элемент.ТекущиеДанные.Идентификатор;
	ЗаполнитьПараметрыURL(Идентификатор);
	ЗаполнитьПараметрыЗаголовков(Идентификатор);
	ЗаполнитьПараметрыЗапроса(Идентификатор);
	ЗаполнитьПараметрыКуки(Идентификатор);
	ЗаполнитьТелоЗапроса(Идентификатор);
	ЗаполнитьОтветы(Идентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтветы

// Обработчик события "ПриАктивизацииСтроки" таблицы "Ответы".
//
// Параметры:
//  Элемент - ПолеФормы
//
&НаКлиенте
Процедура ОтветыПриАктивизацииСтроки(Элемент)
	
	ОчиститьКонтентОтвета();
	ОчиститьЗаголовкиОтвета();
	
	Если Элементы.HTTPСервисы.ТекущиеДанные = Неопределено
			ИЛИ Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Элементы.HTTPСервисы.ТекущиеДанные.Идентификатор;
	Тип = Элемент.ТекущиеДанные.Тип;
	КодСостояния = Элемент.ТекущиеДанные.КодСостояния;
	ЗаполнитьЗаголовкиОтвета(Идентификатор, КодСостояния, Тип);
	ЗаполнитьКонтентОтвета(Идентификатор, КодСостояния, Тип);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТелоЗапроса

// Обработчик события "ПриАктивизацииСтроки" таблицы "ТелоЗапроса".
//
// Параметры:
//  Элемент - ПолеФормы
//
&НаКлиенте
Процедура ТелоЗапросаПриАктивизацииСтроки(Элемент)
	
	ОчиститьКонтентТелаЗапроса();
	
	Если Элементы.HTTPСервисы.ТекущиеДанные = Неопределено
			ИЛИ Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Элементы.HTTPСервисы.ТекущиеДанные.Идентификатор;
	Тип = Элемент.ТекущиеДанные.Тип;
	ЗаполнитьКонтентТелаЗапроса(Идентификатор, Тип);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды "ЗагрузитьСхему".
//
// Параметры:
//  Команда - КомандаФормы
//
&НаКлиенте
Асинх Процедура ЗагрузитьСхему(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Схема OpenAPI (*.json)|*.json'");
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ИндексФильтра = 0;
	
	ВыбранныеФайлы = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ДиалогВыбораФайла.ПолноеИмяФайла, КодировкаТекста.UTF8);
	Объект.СхемаJSON = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Схема1С = НовыйСхема1С(ПрочитатьСхемуJSON(Объект.СхемаJSON));
	
	ОчиститьHTTPСервисы();
	ЗаполнитьHTTPСервисы();
	ЗаполнитьСхемуJSON();
	
КонецПроцедуры

// Обработчик команды "СохранитьСхему".
//
// Параметры:
//  Команда - КомандаФормы
//
&НаКлиенте
Асинх Процедура СохранитьСхему(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Схема OpenAPI (*.json)|*.json'");
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ИндексФильтра = 0;
	
	ВыбранныеФайлы = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьТекста = Новый ЗаписьТекста(ДиалогВыбораФайла.ПолноеИмяФайла, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(Объект.СхемаJSON);
	ЗаписьТекста.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Конструкторы

// Конструктор новой схемы 1С.
//
// Параметры:
//  Схема1С - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура:
//    * Схема - Соответствие, Неопределено
//
&НаКлиентеНаСервереБезКонтекста
Функция НовыйСхема1С(Схема1С)
	
	Возврат Новый Структура("Схема", Схема1С);
	
КонецФункции

#КонецОбласти

// см. СериализацияДанных.ЗаписатьДанныеJSON
//
&НаСервереБезКонтекста
Функция ЗаписатьДанныеJSON(Знач Значение)
	
	Возврат СериализацияДанных.ЗаписатьДанныеJSON(Значение);
	
КонецФункции

// Заполняет HTTP-сервисы на форме.
//
&НаКлиенте
Процедура ЗаполнитьHTTPСервисы()
	
	Если Схема1С = Неопределено ИЛИ Схема1С.Схема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема1С.Схема Цикл
		ЗаполнитьЗначенияСвойств(HTTPСервисы.Добавить(), ЭлементКоллекции.Значение);
	КонецЦикла;
	
	HTTPСервисы.Сортировать("Идентификатор");
	
КонецПроцедуры

// Заполняет контент ответа на форме.
//
// Параметры:
//  Идентификатор - Строка
//  КодСостояния - Число
//  Тип - Строка
//
&НаКлиенте
Процедура ЗаполнитьЗаголовкиОтвета(Идентификатор, КодСостояния, Тип)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Если Схема = Неопределено ИЛИ Схема.Ответы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема.Ответы Цикл
		Если ЭлементКоллекции.Тип = Тип
				И КодСостояния = ЭлементКоллекции.КодСостояния
				И ЭлементКоллекции.Заголовки <> Неопределено Тогда
			Для Каждого ВложенныйЭлементКоллекции Из ЭлементКоллекции.Заголовки Цикл
				ЗаполнитьЗначенияСвойств(ЗаголовкиОтвета.Добавить(), ВложенныйЭлементКоллекции);
			КонецЦикла;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЗаголовкиОтвета.Сортировать("Имя");
	
КонецПроцедуры

// Заполняет контент ответа на форме.
//
// Параметры:
//  Идентификатор - Строка
//  КодСостояния - Число
//  Тип - Строка
//
&НаКлиенте
Процедура ЗаполнитьКонтентОтвета(Идентификатор, КодСостояния, Тип)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Для Каждого ЭлементКоллекции Из Схема.Ответы Цикл
		Если ЭлементКоллекции.Тип = Тип
				И КодСостояния = ЭлементКоллекции.КодСостояния
				И ЭлементКоллекции.Контент <> Неопределено Тогда
			Контент = ЗаписатьДанныеJSON(ЭлементКоллекции.Контент);
			КонтентОтвета = ПредставлениеДереваJSON(Контент, Истина);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет контент тела запроса на форме.
//
// Параметры:
//  Идентификатор - Строка
//  Тип - Строка
//
&НаКлиенте
Процедура ЗаполнитьКонтентТелаЗапроса(Идентификатор, Тип)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Если Схема = Неопределено ИЛИ Схема.ТелоЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема.ТелоЗапроса Цикл
		Если ЭлементКоллекции.Тип = Тип Тогда
			Контент = ЗаписатьДанныеJSON(ЭлементКоллекции.Контент);
			КонтентТелаЗапроса = ПредставлениеДереваJSON(Контент, Истина);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет ответы на форме.
//
// Параметры:
//  Идентификатор - Строка
//
&НаКлиенте
Процедура ЗаполнитьОтветы(Идентификатор)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Если Схема = Неопределено ИЛИ Схема.Ответы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема.Ответы Цикл
		ЗаполнитьЗначенияСвойств(Ответы.Добавить(), ЭлементКоллекции);
	КонецЦикла;
	
	Ответы.Сортировать("КодСостояния,Тип");
	
КонецПроцедуры

// Заполняет параметры URL на форме.
//
// Параметры:
//  Идентификатор - Строка
//
&НаКлиенте
Процедура ЗаполнитьПараметрыURL(Идентификатор)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Если Схема = Неопределено ИЛИ Схема.ПараметрыURL = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема.ПараметрыURL Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыURL.Добавить(), ЭлементКоллекции);
	КонецЦикла;
	
	ПараметрыURL.Сортировать("Имя");
	
КонецПроцедуры

// Заполняет параметры заголовков на форме.
//
// Параметры:
//  Идентификатор - Строка
//
&НаКлиенте
Процедура ЗаполнитьПараметрыЗапроса(Идентификатор)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Если Схема = Неопределено ИЛИ Схема.ПараметрыЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема.ПараметрыЗапроса Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса.Добавить(), ЭлементКоллекции);
	КонецЦикла;
	
	ПараметрыЗапроса.Сортировать("Имя");
	
КонецПроцедуры

// Заполняет параметры запроса на форме.
//
// Параметры:
//  Идентификатор - Строка
//
&НаКлиенте
Процедура ЗаполнитьПараметрыЗаголовков(Идентификатор)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Если Схема = Неопределено ИЛИ Схема.ПараметрыЗаголовков = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема.ПараметрыЗаголовков Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыЗаголовков.Добавить(), ЭлементКоллекции);
	КонецЦикла;
	
	ПараметрыЗапроса.Сортировать("Имя");
	
КонецПроцедуры

// Заполняет параметры из куки на форме.
//
// Параметры:
//  Идентификатор - Строка
//
&НаКлиенте
Процедура ЗаполнитьПараметрыКуки(Идентификатор)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Если Схема = Неопределено ИЛИ Схема.ПараметрыКуки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема.ПараметрыКуки Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыКуки.Добавить(), ЭлементКоллекции);
	КонецЦикла;
	
	ПараметрыЗапроса.Сортировать("Имя");
	
КонецПроцедуры

// Заполняет представление схемы JSON на форме.
//
&НаКлиенте
Процедура ЗаполнитьСхемуJSON()
	
	СхемаJSON = ПредставлениеДереваJSON(Объект.СхемаJSON, Ложь);
	
КонецПроцедуры

// Заполняет тело запроса на форме.
//
// Параметры:
//  Идентификатор - Строка
//
&НаКлиенте
Процедура ЗаполнитьТелоЗапроса(Идентификатор)
	
	Схема = СхемаПоИдентификатору(Идентификатор);
	
	Если Схема = Неопределено ИЛИ Схема.ТелоЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Схема.ТелоЗапроса Цикл
		ЗаполнитьЗначенияСвойств(ТелоЗапроса.Добавить(), ЭлементКоллекции);
	КонецЦикла;
	
	ТелоЗапроса.Сортировать("Тип");
	
КонецПроцедуры

// Очищает HTTP-сервисы на форме.
//
&НаКлиенте
Процедура ОчиститьHTTPСервисы()
	
	HTTPСервисы.Очистить();
	ОчиститьПараметры();
	ОчиститьТелоЗапроса();
	ОчиститьОтветы();
	
КонецПроцедуры

// Очищает заголовки ответа на форме.
//
&НаКлиенте
Процедура ОчиститьЗаголовкиОтвета()
	
	ЗаголовкиОтвета.Очистить();
	
КонецПроцедуры

// Очищает контент ответа на форме.
//
&НаКлиенте
Процедура ОчиститьКонтентОтвета()
	
	КонтентОтвета = ПустойHTML();
	
КонецПроцедуры

// Очищает контент тела запроса на форме.
//
&НаКлиенте
Процедура ОчиститьКонтентТелаЗапроса()
	
	КонтентТелаЗапроса = ПустойHTML();
	
КонецПроцедуры

// Очищает ответы на форме.
//
&НаКлиенте
Процедура ОчиститьОтветы()
	
	Ответы.Очистить();
	ОчиститьЗаголовкиОтвета();
	ОчиститьКонтентОтвета();
	
КонецПроцедуры

// Очищает параметры на форме.
//
&НаКлиенте
Процедура ОчиститьПараметры()
	
	ПараметрыURL.Очистить();
	ПараметрыЗаголовков.Очистить();
	ПараметрыЗапроса.Очистить();
	ПараметрыКуки.Очистить();
	
КонецПроцедуры

// Очищает тело запроса на форме.
//
&НаКлиенте
Процедура ОчиститьТелоЗапроса()
	
	ТелоЗапроса.Очистить();
	ОчиститьКонтентТелаЗапроса();
	
КонецПроцедуры

// Возвращает представление дерева JSON в формате HTML.
//
// Параметры:
//  Данные - Строка
//  ЗаменитьПредставление - Булево
//
// Возвращаемое значение:
//  Строка
//
&НаСервереБезКонтекста
Функция ПредставлениеДереваJSON(Знач Данные, Знач ЗаменитьПредставление)
	
	Макет = ПолучитьОбщийМакет("ПредставлениеДереваJSON").ПолучитьТекст();
	Макет = СтрЗаменить(Макет, "%json%", ЭкранироватьСимволыJSON(Данные));
	Возврат СтрЗаменить(Макет, "%replace%", ?(ЗаменитьПредставление, "true", "false"));
	
КонецФункции

// см. СхемыHTTPСервисов.ПрочитатьСхемуJSON
//
&НаСервереБезКонтекста
Функция ПрочитатьСхемуJSON(Знач СхемаJSON)
	
	Возврат СхемыHTTPСервисов.ПрочитатьСхемуJSON(СхемаJSON);
	
КонецФункции

// Возвращает схема по идентификатору.
//
// Параметры:
//  Идентификатор - Строка
//
// Возвращаемое значение:
//  - Структура
//  - Неопределено
//
&НаКлиенте
Функция СхемаПоИдентификатору(Идентификатор)
	
	Если ТипЗнч(Схема1С.Схема) <> Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Схема1С.Схема.Получить(Идентификатор);
	
КонецФункции

// Экранирует специальные символы в JSON.
//
// Параметры:
//  СтрокаJSON - Строка
//
// Возвращаемое значение:
//  Строка
//
&НаСервереБезКонтекста
Функция ЭкранироватьСимволыJSON(Знач СтрокаJSON)
	
	НоваяСтрокаJSON = СтрЗаменить(СтрокаJSON, "\", "\\");
	НоваяСтрокаJSON = СтрЗаменить(НоваяСтрокаJSON, Символы.ПС, "");
	НоваяСтрокаJSON = СтрЗаменить(НоваяСтрокаJSON, Символы.ВК, "");
	НоваяСтрокаJSON = СтрЗаменить(НоваяСтрокаJSON, "'", "\'");
	Возврат СтрЗаменить(НоваяСтрокаJSON, """", "\""");
	
КонецФункции

// Возвращает пустой HTML.
//
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция ПустойHTML()
	
	Возврат "<html><head></head><body></body></html>";
	
КонецФункции

#КонецОбласти
